var neur_db = [
	{name: "Роль неврології в системі охорони здоров'я. Принципи організації неврологічної і допомоги.", keys: [], not_writed: true},
	{name: "Функціональна анатомія та патологія нервової системи.", keys: ["Психотерапія", "лікування психічнохворих"], not_writed: true},
	{name: "Бульбарний і псевдобульбарний паралічі: основні симптоми, догляд за пацієнтами.", keys: []},
	{name: "Методика обстеження неврологічних хворих.", keys: [], not_writed: true},
	{name: "Додаткові методи обстеження в неврології.", keys: [], not_writed: true},
	{name: "Основні принципи лікування неврологічних хворих та догляду за ними.", keys: [], not_writed: true},
	{name: "Основні методи лікування неврологічних хворих. Психотерапію.", keys: [], not_writed: true},
	{name: "Неврит, невралгія, невропатія. Загальні принципи лікування та догляду за пацієнтами з ураженням периферичної нервової системи.", keys: []},
	{name: "Невралгія трійчастого нерва: етіологія, основні симптоми, лікування, догляд за пацієнтами.", keys: []},
	{name: "Мононеврит лицьового нерва: основні причини, клінічні прояви, лікування, догляд за пацієнтами.", keys: []},
	{name: "Мононеврити нервів верхньої і нижньої кінцівок: основні причини, симптоми, лікування, догляд за пацієнтами.", keys: []},
	{name: "Остеохондроз хребта. Вертеброгенний попереково-крижовий радикуліт: основні симптоми, лікування.", keys: []},
	{name: "Методи витягання хребта при остеохондрозі.", keys: [], not_writed: true},
	{name: "Шийний остеохондроз: клінічні симптоми, основні принципи лікування, догляд за пацієнтами.", keys: []},
	{name: "Гангліоніт (оперізувальний лишай): етіологія, клінічні прояви, лікування.", keys: []},
	{name: "Поліневрит (первинний і вторинний), поліневропатія: основні клінічні симптоми, лікування.", keys: []},
	{name: "Первинний менінгококовий менінгіт: етіологія, епідеміологія. Менінгеальний симптомокомплекс. Зміни в цереброспінальній рідині. Лікування, догляд за пацієнтами.", keys: []},
	{name: "Вторинний гнійний менінгіт: основні причини, клінічні симптоми, лікування, догляд за пацієнтами.", keys: []},
	{name: "Вторинний серозний менінгіт (туберкульозний і сифілітичний): основні симптоми, лікування.", keys: []},
	{name: "Роль молодших медичних працівників у профілактиці сифілісу, туберкульозу, СНІДу.", keys: [], not_writed: true},
	{name: "Арахноїдит: етіологія, клінічні симптоми, лікування.", keys: []},
	{name: "Епідемічний (летаргійний) енцефаліт, гостра і хронічна форми (паркінсонізм): етіологія, основні симптоми, лікування.", keys: []},
	{name: "Кліщовий (весняно-літній) енцефаліт: епідеміологія, основні симптоми, лікування, профілактика", keys: []},
	{name: "Грипозний енцефаліт: основні симптоми, лікування, профілактика.", keys: []},
	{name: "Ревматичний енцефаліт: клінічні форми. Мала хорея, основні симптоми. Лікування і догляд за пацієнтами.", keys: []},
	{name: "Мієлiт: основні причини, клініка. Ускладнення та запобігання їм; лікування і догляд за пацієнтами.", keys: []},
	{name: "Поліомієліт: етіологія, основні клінічні періоди, лікування, профілактика, терміни вакцинації.", keys: []},
	{name: "Розсіяний склероз: етіологія, патогенез, основні симптоми, лікування, догляд за пацієнтами.", keys: []},
	{name: "Основні причини порушень мозкового кровообігу: патогенез, класифікація.", keys: []},
	{name: "Геморагічний інсульт: етіологія, патогенез, основні клінічні форми. Ознаки, невідкладна медична допомога.", keys: []},
	{name: "Субарахноїдальний крововилив: етіологія, патогенез, основні симптоми. Зміни цереброспінальної рідини. Лікування та догляд за пацієнтами.", keys: []},
	{name: "Ішемічний інсультетіологія, патогенез, клінічні прояви, принципи диференційованого лікування, догляд за пацієнтами.", keys: []},
	{name: "Емболія судин мозку: патогенез, основні клінічні симптоми залежно від рівня емболії, лікування, догляд за пацієнтами.", keys: [], not_writed: true},
	{name: "Пухлини головного мозку: загальномозкові і вогнищеві симптоми, додаткові методи, діагностики, зміни в церебральній рідині, лікування, догляд за пацієнтами.", keys: []},
	{name: "Пухлини спинного мозку: внутрішньомозкові (інтрамедулярні) і позамозкові (екстрамедулярні): основні симптоми, лікування, догляд за пацієнтами.", keys: []},
	{name: "Закриті черепномозкові травми: струс, забій, здавлення головного мозку. Основні симптоми.", keys: []},
	{name: "Невідкладна допомога при травмах головного мозку. Догляд за пацієнтами. Ускладнення та їх лікування.", keys: [], not_writed: true},
	{name: "Переломи черепа. Перелом склепіння та основи черепа, основні клінічні симптоми, догляд за пацієнтами.", keys: [], not_writed: true},
	{name: "Травми спинного мозку: класифікація, патогенез, основні клінічні симптоми, ускладнення.", keys: []},
	{name: "Правила транспортування. Лікування і догляд за пацієнтами з травмами спинного мозку.", keys: [], not_writed: true},
	{name: "Транспортування пацієнтів з переломами хребта.", keys: [], not_writed: true},
	{name: "Первинна прогресуюча м'язова дистрофія (міопатія): етіологія, патогенез, основні симптоми, лікування, догляд за пацієнтами.", keys: []},
	{name: "Сирингомієлія: етіологія, патогенез, клінічні форми, особливості лікування.", keys: []},
	{name: "Міастенія та бічний аміотрофічний склероз: етіологія, патогенез, клінічні прояви, основні принципи лікування і догляду за пацієнтами.", keys: [], not_writed: true},
	{name: "Спадкові хвороби обміну та системні дегенерації: види, основні симптоми, лікування.", keys: []},
	{name: "Хвороби нервової системи новонароджених: гіпоксія плода, внутрішньочерепна пологова травма, акушерський параліч.", keys: []},
	{name: "Дитячий церебральний параліч: патогенез, діагностика. Лікування.", keys: []},
	{name: "Хвороби автономної нервової системи: вібраційна хвороба, мігрень, ангіоневротичний набряк (набряк Квінке). Основні клінічні симптоми, лікування.", keys: []},
	{name: "Вегето-судинна дистонія: форми, етіологія, клінічні прояви.", keys: []},
	{name: "Невідкладна медична допомога при симпатикоадреналовому, парасимпатичному (вагоінсулярному) кризовому стані.", keys: []},
	{name: "Основи охорони праці в неврології.", keys: [], not_writed: true},
	{name: "Основні принципи лікування неврологічних хворих.", keys: [], not_writed: true},
	{name: "Ішемічні інсульти, транзиторні ішемічні атаки: етіологія, клінічні прояви, лікування.", keys: []},
	{name: "Субарахноїдальний крововилив: етіологія, клінічні прояви, лікування.", keys: []},
	{name: "Об'ємні процеси ЦНС: етіологія, клінічні прояви, лікування.", keys: []},
	{name: "Травми ЦНС: етіологія, клінічні прояви, лікування.", keys: [], not_writed: true},
	{name: "Хвороби нервової системи новонароджених: етіологія, клінічні прояви, лікування.", keys: []},
	{name: "Хвороби вегетативної нервової системи: етіологія, клінічні прояви, лікування.", keys: []},
	{name: "Інтоксикації нервової системи: етіологія, клінічні прояви, лікування.", keys: []},
	{name: "Основи охорони праці в лікувально-профілактичних установах неврологічного профілю.", keys: [], not_writed: true},
	{name: "Невідкладні стани в неврології: клінічні прояви, невідкладна медична допомога.", keys: [], not_writed: true}
];
var surg_db = [
	{name: "Проведення провідникової анестезії за методом Лукашевича-Оберста", keys: []},
	{name: "Проведення місцевої анестезії хлоретилом.", keys: []},
	{name: "Визначення групи крові за допомогою цоліклональних тестреагентів анти-А та анти-В", keys: []},
	{name: "Визначення груп крові за допомогою стандартних сироваток", keys: []},
	{name: "Визначення резус – належності експрес методом", keys: []},
	{name: "Допомога під час блювання", keys: []},
	{name: "Загальний хірургічний інструментарій", keys: []},
	{name: "Зняття вузлових швів на муляжі", keys: []},
	{name: "Зупинка артеріальної кровотечі з верхньої третини плеча.", keys: []},
	{name: "Зупинка артеріальної кровотечі з нижньої третини стегна.", keys: []},
	{name: "Підготувати набір інструментів для первинної хірургічної обробки рани", keys: []},
	{name: "Скласти набір інструментів для трахеостомії", keys: []},
	{name: "Проведення місцевої анестезії за О.В. Вишневським", keys: []},
	{name: "Скласти набір інструментів для венесекції", keys: []},
	{name: "Надання допомоги в разі відкритого пневмотораксу", keys: []},
	{name: "Накладання гіпсової пов’язки", keys: []},
	{name: "Зняття гіпсової пов’язки", keys: []},
	{name: "Надання допомоги в разі перелому стегна", keys: []},
	{name: "Надання допомоги у випадку перелому кісток передпліччя в середній третині", keys: []},
	{name: "Надання допомоги при переломі діафізу правого плеча", keys: []},
	{name: "Невідкладна допомога при механічній асфіксії.", keys: []},
	{name: "Обробка операційного поля за методом Гроссіха – Філончикова.", keys: []},
	{name: "Обробка рук розчином хлоргексидину біглюконату (гібітану).", keys: []},
	{name: "Обробка рук за методом Спасокукоцького - Кочергіна", keys: []},
	{name: "Обробка рук препаратом С – 4 (первомуром) ", keys: []},
	{name: "Обробка рук за допомогою стериліума.", keys: []},
	{name: "Одягання стерильного халата на хірурга", keys: []},
	{name: "Одягання стерильного халата та рукавичок на себе", keys: []},
	{name: "Контрольна перев'язка асептичної післяопераційної рани", keys: []},
	{name: "Туалет гнійної рани", keys: []},
	{name: "Перев'язка опікової рани", keys: []},
	{name: "Перев'язка поверхневої вкушеної рани", keys: []},
	{name: "Підготовка до роботи стола медсестри-анестезистки", keys: []},
	{name: "Підготовка до роботи перев'язувального стола", keys: []},
	{name: "Виготовлення , стерилізація, зберігання дренажів та гумових випускників", keys: []},
	{name: "Накладання пов’язки 'Вуздечка'", keys: []},
	{name: "Накладання пов’язки Дезо", keys: []},
	{name: "Накладання колосовидної пов’язки на плечовий суглоб", keys: []},
	{name: "Накладання пов'язки 'лицарська рукавичка'", keys: []},
	{name: "Спіральна пов’язка.", keys: []},
	{name: "Накладання пов’язки 'Чепець'", keys: []},
	{name: "Накладання поворотної пов’язки на кисть 'рукавичка'", keys: []},
	{name: "Проведення проби на індивідуальну сумісність крові донора та реципієнта", keys: []},
	{name: "Проведення проби на резус-сумісність", keys: []},
	{name: "Проведення біологічної проби", keys: []},
	{name: "Проведення премедикації", keys: []},
	{name: "Проведення екстренної активно-пасивної профілактики правця.", keys: []},
	{name: "Пункція плевральної порожнини", keys: []},
	{name: "Первинна хірургічна обробка ран при термічних опіках", keys: []},
	{name: "Серцево-легенева реанімація", keys: []},
	{name: "Спеціальний хірургічний інструментарій", keys: []},
	{name: "Транспортування хворого з різними травмами", keys: []},
];
var obst_db = [
	{name: "ПСИХОЛОГІЧНА ПІДГОТОВКА ПАЦІЄНТКИ ДО МАНІПУЛЯЦІЇ", keys: []},
	{name: "ПІДГОТОВКА ГІНЕКОЛОГІЧНОГО КРІСЛА ДО ПІХВОВОЇ МАНІПУЛЯЦІЇ", keys: []},
	{name: "ВИЗНАЧЕННЯ МАСИ ТІЛА ВАГІТНОЇ", keys: []},
	{name: "ЗБІР АНАМНЕЗУ", keys: []},
	{name: "ПІДГОТОВКА ПАЦІЄНТКИ ДО ПІХВОВОЇ МАНІПУЛЯЦІЇ", keys: []},
	{name: "ПІДГОТОВКА РУК АКУШЕРКИ ДО МАНІПУЛЯЦІЇ", keys: []},
	{name: "ПІСЛЯПОЛОГОВИЙ ПАТРОНАЖ ВАГІТНОЇ", keys: []},
	{name: "ВИЯВЛЕННЯ ГРУП ПІДВИЩЕНОГО РИЗИКУ СЕРЕД ВАГІТНИХ", keys: []},
	{name: "ЗАПОВНЕННЯ ОБМІННОЇ КАРТИ ВАГІТНОЇ", keys: []},
	{name: "ДОПОЛОГОВИЙ ПАТРОНАЖ ВАГІТНОЇ", keys: []},
	{name: "ВИМІРЮВАННЯ ОСНОВНИХ ЗОВНІШНІХ РОЗМІРІВ ТАЗА", keys: []},
	{name: "ВИМІРЮВАННЯ ДІАГОНАЛЬНОЇ КОН'ЮГАТИ", keys: []},
	{name: "ВИМІРЮВАННЯ ІНДЕКСУ СОЛОВЙОВА", keys: []},
	{name: "ВИЗНАЧЕННЯ СПРАВЖНЬОЇ КОН'ЮГАТИ", keys: []},
	{name: "ОГЛЯД СТАТЕВИХ ОРГАНІВ В ДЗЕРКАЛАХ", keys: []},
	{name: "ВИМІРЮВАННЯ РОЗМІРІВ ВИХОДУ З ТАЗА", keys: []},
	{name: "ЗАБІР МАТЕРІАЛУ НА ВИЗНАЧЕННЯ СТУПЕНЯ ЧИСТОТИ ПІХВИ", keys: []},
	{name: "ЗАБІР МАТЕРІАЛУ НА БАКТЕРІОСКОПІЧНЕ ДОСЛІДЖЕННЯ", keys: []},
	{name: "ЗОВНІШНЄ АКУШЕРСЬКЕ ДОСЛІДЖЕННЯ, ПРИЙОМИ ЛЕОПОЛЬДА", keys: []},
	{name: "КОМБІНОВАНЕ ПІХВОВО-ЧЕРЕВНОСТІНКОВЕ ДОСЛІДЖЕННЯ", keys: []},
	{name: "ВИЗНАЧЕННЯ ОБВОДУ ЖИВОТА І ВИСОТИ СТОЯННЯ ДНА МАТКИ", keys: []},
	{name: "ВИСЛУХОВУВАННЯ СЕРЦЕБИТТЯ ПЛОДА", keys: []},
	{name: "ВИЗНАЧЕННЯ ТЕРМІНУ ПОЛОГІВ", keys: []},
	{name: "ПІДГОТОВКА РОДІЛЛІДО ВНУТРІШНЬОГО АКУШЕРСЬКОГО ДОСЛІДЖЕННЯ", keys: []},
	{name: "ФІЗИЧНІ ПРИЙОМИ ЗНЕБОЛЮВАННЯ ПОЛОГІВ", keys: []},
	{name: "ПРОВЕДЕННЯ ОКСИТОЦИНОВОГО ТЕСТУ", keys: []},
	{name: "ПІДГОТОВКА АКУШЕРКИ ДО ПРИЙМАННЯ ПОЛОГІВ", keys: []},
	{name: "ПОСИЛЕННЯ ПОЛОГОВОЇ ДІЯЛЬНОСТІ ЗА МЕТОДОМ М.С.БАКШЕЄВА", keys: []},
	{name: "САНІТАРНА ОБРОБКА РОДІЛЛІ ПЕРЕД ПРИЙМАННЯМ ПОЛОГІВ", keys: []},
	{name: "ПРОВЕДЕННЯ ПУДЕНДАЛЬНОЇ АНЕСТЕЗІЇ", keys: []},
	{name: "АКУШЕРСЬКА ДОПОМОГА ПРИ ГОЛОВНОМУ ПЕРЕДЛЕЖАННІ", keys: []},
	{name: "ПЕРИНЕОТОМІЯ", keys: []},
	{name: "ЕПІЗІОТОМІЯ", keys: []},
	{name: "ПЕРШИЙ ТУАЛЕТ НОВОНАРОДЖЕНОГО", keys: []},
	{name: "СПОСОБИ ВИДАЛЕННЯ ВІДОКРЕМЛЕНОЇ ПЛАЦЕНТИ", keys: []},
	{name: "РУЧНЕ ВІДОКРЕМЛЕННЯ І ВИДАЛЕННЯ ПЛАЦЕНТИ", keys: []},
	{name: "РУЧНЕ ОБСТЕЖЕННЯ СТІНОК ПОРОЖНИНИ МАТКИ", keys: []},
	{name: "ПРИТИСНЕННЯ ЧЕРЕВНОЇ АОРТИ", keys: []},
	{name: "ЗАШИВАННЯ РОЗРИВУ ШИЙКИ МАТКИ", keys: []},
	{name: "ЗАШИВАННЯ РОЗРИВІВ ПРОМЕЖИНИ", keys: []},
	{name: "ДОЛІКАРСЬКА ДОПОМОГА ПРИ ЗАГРОЗЛИВОМУ РОЗРИВІ МАТКИ", keys: []},
	{name: "ДОЛІКАРСЬКА ДОПОМОГА ПРИ ВАЖКИХ ФОРМАХ ПІЗНЬОГО ГЕСТОЗУ", keys: []},
	{name: "ФАРМАКОТЕРАПІЯ ВАЖКОЇ ФОРМИ ПІЗНЬОГО ГЕСТОЗУ", keys: []},
	{name: "ДІАГНОСТИКА КЛІНІЧНО ВУЗЬКОГО ТАЗА", keys: []},
	{name: "КЛАСИЧНА РУЧНА ДОПОМОГА ПРИ ТАЗОВИХ ПЕРЕДЛЕЖАННЯХ", keys: []},
	{name: "РУЧНА ДОПОМОГА ПРИ ЧИСТОМУ СІДНИЧНОМУ ПЕРЕДЛЕЖАННІ ЗА МЕТОДОМ ЦОВ`ЯНОВА", keys: []},
	{name: "ВЕДЕННЯ ПОЛОГІВ ПРИ НІЖНИХ ПЕРЕДЛЕЖАННЯХ ЗА МЕТОДОМ ЦОВ`ЯНОВА", keys: []},
	{name: "ПРОВЕДЕННЯ ТУАЛЕТУ ПОРОДІЛЛІ", keys: []},
	{name: "ЗАБІР МАТЕРІАЛУ НА ОНКОЦИТОЛОГІЧНЕ ДОСЛІДЖЕННЯ", keys: []},
	{name: "ЗАБІР МАТЕРІАЛУ НА БАКТЕРИОСКОПІЧНЕ ДОСЛІДЖЕННЯ (ЗАБІР МАТЕРІАЛУ НА ВИЯВЛЕННЯ В МАЗКАХ ГОНОКОКІВ НЕЙСЕРА", keys: []},
	{name: "ДОСЛІДЖЕННЯ СЛИЗУ З ЦЕРВІКАЛЬНОГО КАНАЛУ", keys: []},
	{name: "ЗАБІР МАТЕРІАЛУ НА КОЛЬПОЦИТОЛОПЧНЕ ДОСЛІДЖЕННЯ", keys: []},
	{name: "ВИМІРЮВАННЯ БАЗАЛЬНОЇ ТЕМПЕРАТУРИ", keys: []},
	{name: "ПРОВЕДЕННЯ ПРОБИ ШІЛЛЕРА", keys: []},
	{name: "ПРОВЕДЕННЯ ПІХВОВОГО СПРИНЦЮВАННЯ", keys: []},
	{name: "ПРОВЕДЕННЯ ПІХВОВОЇ ВАННОЧКИ", keys: []},
	{name: "ВВЕДЕННЯ ПІХВОВОЇ ПРИСИПКИ", keys: []},
	{name: "ВВЕДЕННЯ ПІХВОВОГО ТАМПОНА", keys: []},
	{name: "ПРОВЕДЕННЯ ТАМПОНАДИ ПІХВИ", keys: []},
	{name: "КОРИСТУВАННЯ ГУМОВИМ ПЕСАРІЄМ: ОРТОПЕДИЧНЕ ЛІКУВАННЯ ВИПАДІННЯ МАТКИ", keys: []},
	{name: "ОБСТЕЖЕННЯ МОЛОЧНИХ ЗАЛОЗ", keys: []},
	{name: "КОРИСТУВАННЯ ПІХВОВОЮ ДІАФРАГМОЮ", keys: []},
	{name: "ПЕРЕДСТЕРИЛІЗАЦІЙНА ОБРОБКА ІНСТРУМЕНТІВ ПІСЛЯ ОПЕРАЦІЇ", keys: []},
	{name: "ПІДГОТОВКА РУК ДО ОПЕРАЦІЇ РОЗЧИНОМ ДІОЦИДУ", keys: []},
	{name: "ДЕЗІНФЕКЦІЯ І СТЕРИЛІЗАЦІЯ РУКАВИЧОК", keys: []},
	{name: "ПРИГОТУВАННЯ 2,4 % РОЗЧИНУ С-4 (ПЕРВОМУР)", keys: []},
	{name: "ПІДГОТОВКА РУК ДО ОПЕРАЦІЇ ПРЕПАРАТОМ С-4", keys: []},
	{name: "ОБРОБКА ОПЕРАЦІЙНОГО ПОЛЯ ЗА МЕТОДОМ ФІЛОНЧИКОВА- ГРОССІХА", keys: []},
	{name: "ОДЯГАННЯ СТЕРИЛЬНОГО ХАЛАТА І РУКАВИЧОК", keys: []},
	{name: "ЕХНІКА ОБРОБКИ РУК В РОЗЧИНІ ХЛОРГЕКСИДИНУ БІГЛЮКОНАТУ (ГІБІНАТ)", keys: []},
	{name: "ВИЗНАЧЕННЯ РЕЗУС-ФАКТОРА ЕКСПРЕС-МЕТОДОМ ЗА МИХАЙЛОВОЮ", keys: []},
	{name: "ПРАВИЛА НАКРИВАННЯ ВЕЛИКОГО СТЕРИЛЬНОГО СТОЛА", keys: []},
	{name: "ПІДГОТОВКА ПАЦІЄНТА ДО ОПЕРАЦІЇ В ПЛАНОВОМУ ПОРЯДКУ ПІД ЗАГАЛЬНИМ ЗНЕБОЛЮВАННЯМ", keys: []},
	{name: "ВИЗНАЧЕННЯ ГРУПИ КРОВІ ЗА СИСТЕМОЮ АБО ЗА ДОПОМОГОЮ ЦОЛІКЛОНІВ АНТИ-А І АНТИ-В", keys: []},
	{name: "ВИЗНАЧЕННЯ ГРУПИ КРОВІ ЗА СИСТЕМОЮ АБО ЗА ДОПОМОГОЮ СТАНДАРТНИХ ГЕМАГЛЮТИНУЮЧИХ СИРОВАТОК", keys: []},
	{name: "ПІДГОТОВКА РУК ДО ОПЕРАЦІЇ ЗА МЕТОДОМ АЛЬФЕЛЬДА", keys: []},
	{name: "ВИЗНАЧЕННЯ РЕЗУС - СУМІСНОСТІ КРОВІ ПЕРЕД ПЕРЕЛИВАННЯМ", keys: []},
	{name: "ВИЗНАЧЕННЯ ІНДИВІДУАЛЬНОЇ СУМІСНОСТІ КРОВІ ПЕРЕД ПЕРЕЛИВАННЯМ", keys: []},
	{name: "МЕТОДИКА ПРОВЕДЕННЯ ТУАЛЕТУ ВЕРХНІХ ДИХАЛЬНИХ ШЛЯХІВ НОВОНАРОДЖЕНОЇ ДИТИНИ", keys: []},
	{name: "ПРОФІЛАКТИКА ГОНОБЛЕНОРЕЇ", keys: []},
	{name: "ОБРОБКА І ПЕРЕВ`ЯЗКА ПУПОВИНИ", keys: []},
	{name: "ВИМІРЮВАННЯ ДОВЖИНИ ТІЛАНОВОНАРОДЖЕНОЇ ДИТИНИ І ДІТЕЙ ГРУДНОГО ВІКУ", keys: []},
	{name: "ЗВАЖУВАННЯ НОВОНАРОДЖЕНОГО і ДІТЕЙГРУДНОГО ВІКУ", keys: []},
	{name: "МЕТОДИКА ВИЗНАЧЕННЯ ОБВОДУ ГОЛОВИ, ГРУДНОЇ КЛІТКИ У ДІТЕЙ", keys: []},
	{name: "ГІГІЄНІЧНА ДЕКОНТОМІНАЦІЯ РУК МЕДПЕРСОНАЛУ", keys: []},
	{name: "ПРАВИЛА ПРИГОТУВАННЯ ДЕЗІНФІКУЮЧИХ ХЛОРОВМІСНИХ РОЗЧИНІВ", keys: []},
	{name: "ПЕРЕДСТИРИЛІЗАЦІЙНА ОЧИСТКА ШПРИЦІВ, ГОЛОК ТА ІНСТРУМЕНТАРІЮ", keys: []},
	{name: "ПРИГОТУВАННЯ СЕРВЕТОК", keys: []},
	{name: "ЗНЕРАЖЕННЯ ШПРИЦІВ, ГОЛОК, ІНСТРУМЕНТАРІЮ", keys: []},
	{name: "ВОЛОГЕ ПРИБИРАННЯ ПАЛАТИ", keys: []},
	{name: "ПОСТАНОВКА ПРОБ ДЛЯ КОНТРОЛЮ ЯКОСТІ ПЕРЕДСТЕРИЛІЗАЦІЙНОЇ ОЧИСТКИ ШПРИЦІВ, ГОЛОК ТА ІНСТРУМЕНТІВ", keys: []},
	{name: "СТЕРИЛІЗАЦІЯ ШПРИЦІВ ТА ГОЛОК КИП`ЯТІННЯМ", keys: []},
	{name: "ПРИГОТУВАННЯ КУЛЬОК З МАРЛІ І ВАТИ", keys: []},
	{name: "КОНТРОЛЬ ЯКОСТІ СТЕРИЛІЗАЦІЇ В АВТОКЛАВАХ", keys: []},
	{name: "ПОВІТРЯНА СТЕРИЛІЗАЦІЯ", keys: []},
	{name: "ПРАВИЛА ВКЛАДАННЯ МАТЕРІАЛУ В БІКС", keys: []},
	{name: "ОБРОБКА ПАЦІЄНТА ПРИ ПЕДИКУЛЬОЗІ", keys: []},
	{name: "ОБРОБКА ПАЦІЄНТА ПРИ ПЕДИКУЛЬОЗІ ПАРА-ПЛЮС", keys: []},
	{name: "ОБРОБКА ПАЦІЄНТА ПРИ ПЄДИКУЛЬОЗІ НІТІФОРОМ", keys: []},
	{name: "ВИМІРЮВАННЯ ЗРОСТУ РОСТОМІРОМ", keys: []},
	{name: "ПІДМИВАННЯ ПАЦІЄНТІВ", keys: []},
	{name: "ЗАСТОСУВАННЯ ГРІЛКИ", keys: []},
	{name: "ПРОФІЛАКТИКА ПРОЛЕЖНІВ", keys: []},
	{name: "ВИМІРЮВАННЯ ТЕМПЕРАТУРИ ТІЛА", keys: []},
	{name: "ДОГЛЯД ЗА ПАЦІЄНТАМИ ПІД ЧАС ГАРЯЧКИ", keys: []},
	{name: "КАТЕТЕРИЗАЦІЯ СЕЧОВОГО МІХУРА", keys: []},
	{name: "ВИМІРЮВАННЯ АРТЕРІАЛЬНОГО ТИСКУ", keys: []},
	{name: "ДОСЛІДЖЕННЯ ПУЛЬСУ НА ПРОМЕНЕВІЙ АРТЕРІЇ", keys: []},
	{name: "ЗАСТОСУВАННЯ МІХУРА З ЛЬОДОМ", keys: []},
	{name: "НАКЛАДАННЯ ЗІГРІВАЛЬНОГО КОМПРЕСУ", keys: []},
	{name: "НАБИРАННЯ ЛІКІВ З ФЛАКОНІВ", keys: []},
	{name: "РОЗВЕДЕННЯ АНТИБІОТИКІВ", keys: []},
	{name: "ЗБИРАННЯ СЕЧІ НА ЗАГАЛЬНИЙ АНАЛІЗ", keys: []},
	{name: "ПРОБИ НА ЧУТЛИВІСТЬ ДО АНТИБІОТИКІВ", keys: []},
	{name: "ЗАБІР КРОВІ З ВЕНИ", keys: []},
	{name: "НАБИРАННЯ ЛІКІВ З АМПУЛ", keys: []},
	{name: "ПІДШКІРНА ІН`ЄКЦІЯ", keys: []},
	{name: "ВНУТРІШНЬОШКІРНА ІН`ЄКЦІЯ", keys: []},
	{name: "ВВЕДЕННЯ РІДИНИ КРАПЕЛЬНИМ МЕТОДОМ", keys: []},
	{name: "ВНУТРІШНЬОВЕННА ІН`ЄКЦІЯ", keys: []},
	{name: "ВНУТРІШНЬОМ`ЯЗОВА ІН`ЄКЦІЯ", keys: []},
	{name: "ІНТЕНСИВНА ТЕРАПІЯ ПРИ АНАФІЛАКТИЧНОМУ ШОЦІ", keys: []},
	{name: "ТЕХНІКА НАКЛАДАННЯ ВУЗЛОВИХ ШВІВ", keys: []},
	{name: "НЕВІДКЛАДНА ДОПОМОГА ПРИ ГІПОТОНІЧНІЙ КРОВОТЕЧІ", keys: []},
	{name: "ВИЗНАЧЕННЯ БІЛКА В СЕЧІ", keys: []},
	{name: "ПІДГОТОВКА СТЕРИЛЬНОГО СТОЛИКА ДО ПРИЙМАННЯ ПОЛОГІВ", keys: []},
	{name: "ВИЗНАЧЕННЯ КРОВОВТРАТИ В ПОЛОГАХ", keys: []},
	{name: "СПОСТЕРЕЖЕННЯ ЗА РОЗВИТКОМ ПОЛОГОВОЇ ДІЯЛЬНОСТІ", keys: []},
	{name: "ОЗНАКИ ВІДОКРЕМЛЕННЯ ПЛАЦЕНТИ ВІД СТІНОК МАТКИ", keys: []},
	{name: "ОГЛЯД ПОСЛІДУ", keys: []},
	{name: "КУРАЦІЯ ВАГІТНИХ", keys: []},
	{name: "БІМАНУАЛЬНЕ ОБСТЕЖЕННЯ", keys: []},
	{name: "НЕВІДКЛАДНА ДОПОМОГА ПІД ЧАС НАПАДУ ЕКЛАМПСІЇ", keys: []},
	{name: "ПРОБА МАК-КЛЮРА-ОЛДРІЧА", keys: []},
	{name: "МЕТОДИКА АНАЛЬГЕЗІЇ ЗАКИСОМ АЗОТУ", keys: []},
	{name: "ВИЗНАЧЕННЯ ЧЛЕНОРОЗТАШУВАННЯ ПЛОДА", keys: []},
	{name: "ЗАПОВНЕННЯ НАПРАВЛЕНЬ ДО ЛАБОРАТОРІЇ", keys: []},
	{name: "УЗЯТТЯ КРОВІ НА ВІЛ-ІНФЕКЦІЮ", keys: []},
	{name: "ОБСТЕЖЕННЯ ВАГІТНОЇ ПРИ НАПРАВЛЕННІ НА ШТУЧНЕ ПЕРЕРИВАННЯ ВАГІТНОСТІ", keys: []},
	{name: "УЗЯТТЯ МАЗКА НА НАЯВНІСТЬ ГОНОКОКА", keys: []},
	{name: "НАБІР ІНСТРУМЕНТІВ ДЛЯ ШТУЧНОГО ПЕРЕРИВАННЯ ВАГІТНОСТІ", keys: []},
	{name: "АМНІОТОМІЯ", keys: []},
	{name: "БІМАНУАЛЬНЕ ОБСТЕЖЕННЯ ПРИ ПОЛОГАХ", keys: []},
	{name: "ВИЗНАЧЕННЯ ОЗНАКИ ВАСТЕНА", keys: []},
	{name: "ВИЗНАЧЕННЯ ОЗАКИ ЦАНГЕМЕЙСТЕРА", keys: []},
	{name: "НЕВІДКЛАДНА ДОПОМОГА ПОЗА АКУШЕРСЬКИМ СТАЦІОНАРОМ ПРИ ПЕРЕДЛЕЖАННІ ПЛАЦЕНТИ", keys: []},
	{name: "НЕВІДКЛАДНА ДОПОМОГА В УМОВАХ АКУШЕРСЬКОГО СТАЦІОНАРУ ПРИ ПЕРЕДЛЕЖАННІ ПЛАЦЕНТИ", keys: []},
	{name: "НЕВІДКЛАДНА ДОПОМОГА ПОЗА АКУШЕРСЬКИМ СТАЦІОНАРОМ У РАЗІ ПЕРЕДЧАСНОГО ВІДШАРУВАННЯ НОРМАЛЬНО РОЗТАШОВАНОЇ ПЛАЦЕНТИ", keys: []},
	{name: "НЕВІДКЛАДНА ДОПОМОГА В УМОВАХ АКУШЕРСЬКОГО СТАЦІОНАРУ У РАЗІ ПЕРЕДЧАСНОГО ВІДШАРУВАННЯ НОРМАЛЬНО РОЗТАШОВАНОЇ ПЛАЦЕНТИ", keys: []},
	{name: "ОГЛЯД ШИЙКИ МАТКИ В РАННІЙ ПІСЛЯПОЛОГОВИЙ ПЕРІОД", keys: []},
	{name: "НАДАННЯ МЕДИЧНОЇ ДОПОМОГИ В РАЗІ ПАТОЛОГІЇ ПРИКРІПЛЕННЯ АБО ЗАЩЕМЛЕННЯ ПЛАЦЕНТИ", keys: []},
	{name: "ЗОВНІШНІЙ МАСАЖ МАТКИ", keys: []},
	{name: "УВЕДЕННЯ ТАМПОНА З ЕФІРОМ У ЗАДНЄ СКЛЕПІННЯ ПІХВИ", keys: []},
	{name: "ПРИТИСКАННЯ НИХНЬОГО СЕГМЕНТА МАТКИ ДО ХРЕБТА", keys: []},
	{name: "НАКЛАДАННЯ КЛЕМ НА ПАРАМЕРРІЙ", keys: []},
	{name: "ТАМПОНАДА МАТКИ", keys: []},
	{name: "НЕВІДКЛАДНА ДОПОМОГА ТА ЛІКУВАННЯ В РАЗІ ЕМБОЛІЇ НАВКОЛОПЛІДНИМИ ВОДАМИ", keys: []},
	{name: "НЕВІДКЛАДНА ДОПОМОГА ТА ЛІКУВАННЯ В РАЗІ ВИНИКНЕННЯ СИНДРОМУ ДИСЕМІНОВАНОГО ВНУТРІШНЬОСУДИННОГО ЗГОРТАННЯ КРОВІ (ДВЗ-СИНДРОМУ)", keys: []},
	{name: "ЗНЯТТЯ ШВІВ ІЗ ПРОМЕЖИНИ", keys: []},
	{name: "ВПРАВЛЕННЯ МАТКИ В РАЗІ ЇЇ ПІСЛЯПОЛОГОВОГО ВИВОРОТУ", keys: []},
	{name: "ДОГЛЯД ЗА ШВАМИ НА ПРОМЕЖИНІ", keys: []},
	{name: "ТУАЛЕТ ПОРОДІЛЛІ", keys: []},
	{name: "ПРОВЕДЕННЯ ПОСІВІВ НА ГОНОРЕЮ", keys: []},
	{name: "ПАЛЬЦЕВЕ РОЗШИРЕННЯ КАНАЛУ ШИЙКИ МАТКИ", keys: []},
	{name: "РОЗСІЧЕННЯ КРАЇВ МАТКОВОГО ВІЧКА", keys: []},
	{name: "ДОГЛЯД ЗА МОЛОЧНИМИ ЗАЛОЗАМИ", keys: []},
	{name: "АКТИВНЕ ВЕДЕННЯ ІІІ-ГО ПЕРІОДУ ПОЛОГІВ", keys: []},
	{name: "ОЦІНЮВАННЯ НОВОНАРОДЖЕНОГО ЗА ШКАЛОЮ АПГАР", keys: []},
	{name: "ПІДГОТОВКА ПАЦІЄНТКИ, ІНСТРУМЕНТІВ, ПЕРЕВ`ЯЗУВАЛЬНОГО МАТЕРІАЛУ ДО ЗОНДУВАННЯ", keys: []},
	{name: "ПІДГОТОВКА ПАЦІЄНТКИ, ІНСТРУМЕНТІВ, ПЕРЕВ`ЯЗУВАЛЬНОГО МАТЕРІАЛУ ДО ДІАГНОСТИЧНОГО ВИШКРІБАННЯ СЛИЗОВОЇ ОБОЛОНКИ ТІЛА МАТКИ ТА КАНАЛУ ШИЙКИ МАТКИ", keys: []},
	{name: "ПІДГОТОВКА ПАЦІЄНТКИ, ІНСТРУМЕНТІВ, ПЕРЕВ1ЯЗУВАЛЬНОГО МАТЕРІАЛУ ДО ПУНКЦІЇ ЧЕРЕЗ ЗАДНЄ СКЛЕПІННЯ ПІХВИ", keys: []},
	{name: "ПІДГОТОВКА ПАЦІЄНТКИ, ІНСТРУМЕНТІВ, ПЕРЕВ`ЯЗУВАЛЬНОГО МАТЕРІАЛУ ДО БІОПСІЇ", keys: []},
	{name: "ПІДГОТОВКА ЖІНКИ ТА ІНСТРУМЕНТІВ ДО МЕТРОСАЛЬПІНГОГРАФІЇ", keys: []},
	{name: "ПІДГОТОВКА ЖІНКИ ТА ІНСТРУМЕНТІВ ДО КОЛЬПОСКОПІЇ", keys: []},
	{name: "ПІДГОТОВКА ДО УЛЬТРАЗВУКОВОГО ДОСЛІДЖЕННЯ", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
	{name: "", keys: []},
];
var test_obst_db = [
	{name: "Особливості та значення анамнезу в гінекології, методика збирання анамнезу.", keys: []},
	{name: "Дослідження в гінекології (інструментальні).Методика і значення гінекологічного дослідження. Додаткові методи дослідження в гінекології (інструментальні).", keys: []},
	{name: "Неправильні положення матки: причини, клінічні прояви,  діагностика,  профілактика.", keys: []},
	{name: "Порушення менструального циклу (за типом дисфункційних маткових кровотеч): етіологія, клінічні прояви,  діагностика,  профілактика.", keys: []},
]
function show_header(site = "Stud+", is_main = false){
	if(is_main){
		var header = '<header class="header">' + site + '<a href="../index.html" class="to_home">Домой</a></header>' 
	}else{
		var header = '<header class="header">' + site + '</header>' ;
	}
	$("body").prepend(header);
}
function show_content(arr, cat_name) {
	var container = document.getElementById('container');
	function k_counter(){
			if (k+1 < 10){
				return '0' + (k+1);
			}else{
				return k + 1;
			}
		};
	for(var k = 0; k < arr.length; k++){
		if(arr[k].not_writed){
				var link = '<div class="theme_item"><a href="../' + cat_name + '/p' + (k+1) + '.html" class="description not_writed"><div class="num">' + k_counter() + '</div>' + arr[k].name + '</a></div>';
			}else{
				var link = '<div class="theme_item"><a href="../' + cat_name + '/p' + (k+1) + '.html" class="description"><div class="num">' + k_counter() + '</div>' + arr[k].name + '</a></div>';
			}
		container.innerHTML += link;
	}
}
function search_content(arr, cat_name){
	var search_value = document.getElementById('search').value;
	var cont = document.getElementById('container');
	counter.innerHTML = "";
	var temple_container = [];
	var reg_exp_search = new RegExp(search_value, 'gim');
	function counter(){
		if (i+1 < 10){
			return '0' + (i+1);
		}else{
			return i + 1;
		}
	};
	for(var i = 0; i < arr.length; i++){
		if(search_value == ""){
			if(arr[i].not_writed){
				var link = '<div class="theme_item"><a href="../' + cat_name + '/p' + (i+1) + '.html" class="description not_writed"><div class="num">' + counter() + '</div>' + arr[i].name + '</a></div>';
			}else{
				var link = '<div class="theme_item"><a href="../' + cat_name + '/p' + (i+1) + '.html" class="description"><div class="num">' + counter() + '</div>' + arr[i].name + '</a></div>';
			}
			temple_container.push(link);
		}else if(search_value == "#"){
			for(var t = 0; t < test_obst_db.length; t++){
				var link = '<div class="theme_item"><a href="../test_obst_db/p' + (t+1) + '.html" class="description"><div class="num">0' + (t+1) + '</div>' + test_obst_db[t].name + '</a></div>';
			temple_container.push(link);
			}
		}else if(search_value == i+1){
			container.innerHTML = "";
			if(arr[i].not_writed){
				var link = '<div class="theme_item"><a href="../' + cat_name + '/p' + (i+1) + '.html" class="description not_writed"><div class="num">' + counter() + '</div>' + arr[i].name + '</a></div>';
			}else{
				var link = '<div class="theme_item"><a href="../' + cat_name + '/p' + (i+1) + '.html" class="description"><div class="num">' + counter() + '</div>' + arr[i].name + '</a></div>';
			}
			temple_container.push(link);
		}else if(arr[i].name.match(reg_exp_search)){
			container.innerHTML = "";
			if(arr[i].not_writed){
				var link = '<div class="theme_item"><a href="../' + cat_name + '/p' + (i+1) + '.html" class="description not_writed"><div class="num">' + counter() + '</div>' + arr[i].name + '</a></div>';
			}else{
				var link = '<div class="theme_item"><a href="../' + cat_name + '/p' + (i+1) + '.html" class="description"><div class="num">' + counter() + '</div>' + arr[i].name + '</a></div>';
			}
			temple_container.push(link);
		}else{
			container.innerHTML = "";
			for(var j = 0; j < arr[i].keys.length; j++){
				if(arr[i].keys[j].match(reg_exp_search)){
					if(arr[i].not_writed){
						var link = '<div class="theme_item"><a href="../' + cat_name + '/p' + (i+1) + '.html" class="description not_writed"><div class="num">' + counter() + '</div>' + arr[i].name + '</a></div>';
					}else{
						var link = '<div class="theme_item"><a href="../' + cat_name + '/p' + (i+1) + '.html" class="description"><div class="num">' + counter() + '</div>' + arr[i].name + '</a></div>';
					}
					temple_container.push(link)
				}
			}
		}
		container.innerHTML = temple_container.join(" ");
		document.body.appendChild(container);
	}
}
function back_button(back_url = "#"){
	var cont = document.getElementById('container');
	var back = '<a href="' + back_url + '" class="back_button">Назад</a>';
	$(cont).append(back);
}